//--------------------------------------------------------------------------------
//
//　fade.h
//	Author : Xu Wenjie
//	Date   : 2016-12-27
//--------------------------------------------------------------------------------
//  Update : 
//	
//--------------------------------------------------------------------------------
#ifndef _FADE_H_
#define _FADE_H_

//--------------------------------------------------------------------------------
//  インクルードファイル
//--------------------------------------------------------------------------------
#include "main.h"
#include "manager.h"

//--------------------------------------------------------------------------------
//  定数定義
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  プロトタイプ宣言
//--------------------------------------------------------------------------------

//--------------------------------------------------------------------------------
//  クラス宣言
//--------------------------------------------------------------------------------
class CFade
{
public:
	typedef enum
	{
		FADE_NONE = 0,
		FADE_IN,
		FADE_OUT,
		FADE_MAX
	}FADE;//フェイドの状態

	CFade();
	~CFade();

	void	Init(void);
	void	Uninit(void);
	void	Update(void);
	void	Draw(void);
	void	SetFade(const FADE &fade, const CManager::MODE &modeNext);

	static CFade *Create(void);
private:
	void SetColorFade(const CKFColor &cColor);

	CKFColor					m_cColor;
	FADE						m_fade;//fade mode
	CManager::MODE				m_modeNext;//roop mode
	int							m_nCnt;
	LPDIRECT3DVERTEXBUFFER9		m_pVtxBuffer;	//頂点バッファ管理インターフェースポインタ
};

#endif